In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.Series([1,2,3,10,20,30],index=[1,2,3,1,2,3])
agg=df.groupby(level=0)

In [10]:
agg.sum()

1    11
2    22
3    33
dtype: int64

In [8]:
agg.first()

1    1
2    2
3    3
dtype: int64

In [9]:
agg.last()

1    10
2    20
3    30
dtype: int64

In [11]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two','three','two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.472381 -1.768665
1  bar    one -0.230073 -0.508440
2  foo    two -1.298922 -1.434619
3  bar  three  0.368422 -0.708976
4  foo    two -0.811132 -1.200313
5  bar    two -0.969712  1.845219
6  foo    one  0.980473 -1.634187
7  foo  three -0.068080  0.486090

In [12]:
df.groupby(['A']).groups

{'bar': Int64Index([1, 3, 5], dtype='int64'),
 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [13]:
df.groupby(['A','B']).groups

{('bar', 'one'): Int64Index([1], dtype='int64'),
 ('bar', 'three'): Int64Index([3], dtype='int64'),
 ('bar', 'two'): Int64Index([5], dtype='int64'),
 ('foo', 'one'): Int64Index([0, 6], dtype='int64'),
 ('foo', 'three'): Int64Index([7], dtype='int64'),
 ('foo', 'two'): Int64Index([2, 4], dtype='int64')}

In [15]:
len(df.groupby(['A','B']))

6

In [16]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [38]:
index=pd.MultiIndex.from_arrays(arrays,names=['first','second'])
s=pd.DataFrame({'A':[1,1,1,1,2,2,3,3],'B':np.random.randn(8)},index=index)
s

              A         B
first second
bar   one     1 -1.932989
      two     1  1.175453
baz   one     1  0.457611
      two     1 -0.316805
foo   one     2 -0.358320
      two     2  0.295329
qux   one     3 -1.193767
      two     3 -0.273404

In [39]:
s.groupby(level=0).get_group('foo')

              A         B
first second
foo   one     2 -0.358320
      two     2  0.295329

In [40]:
s.groupby(level='first').get_group('foo')

              A         B
first second
foo   one     2 -0.358320
      two     2  0.295329

In [41]:
s.sum(level='first')

       A         B
first
bar    2 -0.757536
baz    2  0.140806
foo    4 -0.062991
qux    6 -1.467172

In [46]:
for i,j in s.groupby(level='first'):
    print(i)
    print(j)

bar
              A         B
first second
bar   one     1 -1.932989
      two     1  1.175453
baz
              A         B
first second
baz   one     1  0.457611
      two     1 -0.316805
foo
              A         B
first second
foo   one     2 -0.358320
      two     2  0.295329
qux
              A         B
first second
qux   one     3 -1.193767
      two     3 -0.273404

In [47]:
s.groupby(level='first').size()

first
bar    2
baz    2
foo    2
qux    2
dtype: int64

In [57]:
s.groupby(['first','second'])[['B']].mean()

first  second
bar    one      -1.932989
       two       1.175453
baz    one       0.457611
       two      -0.316805
foo    one      -0.358320
       two       0.295329
qux    one      -1.193767
       two      -0.273404
Name: B, dtype: float64

In [72]:
df=pd.DataFrame(np.random.randn(5,5),index=['joe','steve','wes','jim','travis'],columns=list('abcde'))
df

               a         b         c         d         e
joe    -0.123389 -0.218310 -1.469214 -1.535313 -0.587661
steve   1.543657  0.620926  0.011439 -2.028836  0.348079
wes    -1.313017 -0.972347  0.001844 -0.873481 -1.598629
jim     0.782103  0.475052 -0.284322 -0.755268  1.252855
travis  0.692966 -0.450032 -0.308474  0.028852  0.474347

In [75]:
df.iloc[2,1:3]=np.nan

In [76]:
df

               a         b         c         d         e
joe    -0.123389 -0.218310 -1.469214 -1.535313 -0.587661
steve   1.543657  0.620926  0.011439 -2.028836  0.348079
wes    -1.313017       NaN       NaN -0.873481 -1.598629
jim     0.782103  0.475052 -0.284322 -0.755268  1.252855
travis  0.692966 -0.450032 -0.308474  0.028852  0.474347

In [77]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [80]:
df_group=df.groupby(mapping,axis=1)
df_group.sum()

            blue       red
joe    -3.004526 -0.929361
steve  -2.017397  2.512662
wes    -0.873481 -2.911646
jim    -1.039590  2.510010
travis -0.279622  0.717282

In [81]:
map_series=pd.Series(mapping)

In [82]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [83]:
map_series.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [84]:
df.groupby(mapping,axis=1).count()

        blue  red
joe        2    3
steve      2    3
wes        1    2
jim        2    3
travis     2    3

In [86]:
df.groupby(map_series,axis=1).count()

        blue  red
joe        2    3
steve      2    3
wes        1    2
jim        2    3
travis     2    3

# 通过函数进行分组

相较于字典或Series，Python函数在定义分组映射关系时可以更有创意且更为抽象。任何被当作分组键的函数都会在各个索引值上被调用一次，其返回值就会被用作分组名称。具体点说，以上一小节的示例df为例，其索引值为人名。假设你希望根据人名的长度进行分组，虽然可以求取一个字符串长度数组，但其实仅仅传入len函数就可以了

In [87]:
df.groupby(len).sum()#传入len，根据人名长度进行分组

          a         b         c         d         e
3 -0.654303  0.256742 -1.753536 -3.164061 -0.933436
5  1.543657  0.620926  0.011439 -2.028836  0.348079
6  0.692966 -0.450032 -0.308474  0.028852  0.474347

将函数跟数组、列表、字典、Series混合使用也不是问题，因为任何东西最终都会被转换为数组：

In [88]:
key_list=['one','one','one','two','two']

In [89]:
df.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.313017 -0.218310 -1.469214 -1.535313 -1.598629
  two  0.782103  0.475052 -0.284322 -0.755268  1.252855
5 one  1.543657  0.620926  0.011439 -2.028836  0.348079
6 two  0.692966 -0.450032 -0.308474  0.028852  0.474347


# 根据索引级别分组

层次化索引数据集最方便的地方就在于它能够根据索引级别进行聚合。要实现该目的，通过level关键字传入级别编号或名称即可：

In [93]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['city','tenor'])
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)
hier_df

city         US                            JP
tenor         1         3         5         1         3
0     -1.827473 -0.380197 -0.957974 -0.419386 -0.703190
1     -0.548995 -1.032929 -0.471543  2.115977  0.620021
2     -0.012192 -0.532148 -0.780918 -1.637225 -2.286696
3      0.103577  2.202510 -0.111661 -0.687307  0.223921

In [94]:
hier_df.groupby(level='city',axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

# 数据聚合

对于聚合，我指的是任何能够从数组产生标量值的数据转换过程。之前的例子中我已经用过一些，比如mean、count、min以及sum等。你可能想知道在GroupBy对象上调用mean()时究竟发生了什么。许多常见的聚合运算都有就地计算数据集统计信息的优化实现。然而，并不是只能使用这些方法。你可以使用自己发明的聚合也就运算，还可以调用分组对象上已经定义好的任何方法。例如，quantile可以计算Series或DataFrame列的样本分位数：

In [120]:
df=pd.DataFrame({'key2':['one','two','one','two','one'],'key1':list('aabba'),'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

      data1     data2 key1 key2
0 -0.034986  0.603733    a  one
1  0.145655  1.123489    a  two
2  1.314203 -0.808792    b  one
3 -0.548872  1.513315    b  two
4  0.137118  0.717739    a  one

In [121]:
grouped=df.groupby('key1')
grouped[['data1']].quantile(0.9)

0.9      data1
key1
a     0.143947
b     1.127895

In [122]:
grouped['data1'].quantile(0.9)

key1
a    0.143947
b    1.127895
Name: data1, dtype: float64

虽然quantile并没有明确地实现于GroupBy，但它是一个Series方法，所以这里是能用的。实际上，GroupBy会高效地对Series进行切片，然后对各片调用piece.quantile（0.9），最后这些结果组装成最终结果。

如果要使用你自己的聚合函数，只需将其传入aggregate或agg方法即可：

In [123]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [124]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.180641  0.519756
b     1.863075  2.322107

In [126]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.082596  0.101918 -0.034986  0.051066  0.137118  0.141386
b      2.0  0.382665  1.317393 -0.548872 -0.083103  0.382665  0.848434

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.145655   3.0  0.814987  0.273184  0.603733  0.660736  0.717739
b     1.314203   2.0  0.352261  1.641977 -0.808792 -0.228265  0.352261


           75%       max
key1
a     0.920614  1.123489
b     0.932788  1.513315

In [131]:
df = pd.DataFrame({'A': [1, 1, 2, 2],
                   'B': [1, 2, 3, 4],
                   'C': np.random.randn(4)})
df

   A  B         C
0  1  1  0.440776
1  1  2  0.849333
2  2  3  1.190407
3  2  4 -1.043405

In [132]:
df.groupby(['A']).agg(min)

   B         C
A
1  1  0.440776
2  3 -1.043405

In [133]:
df.groupby('A').apply(np.average,axis=1)

A
1    [0.813591885853, 1.28311087649]
2     [2.06346884223, 1.65219835292]
dtype: object

In [134]:
df.groupby('A').agg(np.average)

     B         C
A
1  1.5  0.645054
2  3.5  0.073501

In [138]:
df.groupby(['A']).get_group(2)

   A  B         C
2  2  3  1.190407
3  2  4 -1.043405

# 面向列的多函数应用

我们已经看到，对Series或DataFrame列的聚合运算其实就是使用aggregate（使用自定义函数）或调用诸如mean、std之类的方法。然而，你可能希望对不同的列使用不同的聚合函数，或一次应用多个函数。其实这事也好办，我将通过一些示例进行讲解。首先，我根据sex和smoke对tips进行分组：

In [158]:
df=pd.read_csv(r'./tips.csv')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [159]:
df['tip_pct']=df['tip']/df['total_bill']
df.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

如果传入一组函数或函数名，得到的DataFrame的列就会以相应的函数命名

In [171]:
def peak_to_peak(arr):
    return arr.max()-arr.min()
df.groupby(['sex','smoker']).agg([np.mean,'std',peak_to_peak])

              total_bill                              tip            \
                    mean       std peak_to_peak      mean       std
sex    smoker
Female No      18.105185  7.286455        28.58  2.773519  1.128425
       Yes     17.977879  9.189751        41.23  2.931515  1.219916
Male   No      19.791237  8.726566        40.82  3.113402  1.489559
       Yes     22.284500  9.911845        43.56  3.051167  1.500120

                                size                          tip_pct  \
              peak_to_peak      mean       std peak_to_peak      mean
sex    smoker
Female No             4.20  2.592593  1.073146            5  0.156921
       Yes            5.50  2.242424  0.613917            3  0.182150
Male   No             7.75  2.711340  0.989094            4  0.160669
       Yes            9.00  2.500000  0.892530            4  0.152771


                    std peak_to_peak
sex    smoker
Female No      0.036421     0.195876
       Yes     0.071595     0.360233
Male   No      0.041849     0.220186
       Yes     0.090588     0.674707

如你所见，结果DataFrame拥有层次化的列，这相当于分别对各列进行聚合，然后用concat将结果组装到一起（列名用做keys参数）。

In [172]:
df.groupby(['sex','smoker'])['tip_pct'].agg(['mean',np.std,peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

你并非一定要接受GroupBy自动给出的那些列名，特别是lambda函数，它们的名称是”<#lambda>“这样的辨识度就下降了（通过函数的name属性看看就知道了）。<table><tr><td bgcolor=red>如果传入的是一个由（name，function）元组组成的列表，则各元组的第一个元素就会被用作DataFrame的列名<\td><\tr><\table>（可以将这种二元元组列表看做一个有序映射）：

In [173]:
df.groupby(['sex','smoker'])['tip_pct'].agg([('foo','mean'),('bar',np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

<table><tr><td bgcolor=red>现在，假设你想要对不同的列应用不同的函数。具体的办法是向agg传入一个从列名映射到函数的字典<\td><\tr><\table>

In [179]:
df.groupby(['sex','smoker']).agg({'tip':np.max,'size':'sum','day':'count'})

                tip  size  day
sex    smoker
Female No       5.2   140   54
       Yes      6.5    74   33
Male   No       9.0   263   97
       Yes     10.0   150   60

<table><tr><td bgcolor=red>也可对一列进行多个函数的操作<\td><\tr><\table>

In [181]:
df.groupby(['sex','smoker']).agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

只有将多个函数应用到至少一列时，DataFrame才会拥有层次化的列

# 以”无索引“的形式返回聚合数据

到目前为止，所有示例中的聚合数据都有由唯一的分组键组成的索引（可能还是层次化的）。由于并不总是需要如此，所以你可以向groupby传入as_index=False以禁用该功能：

In [184]:
df.groupby(['sex','smoker'],as_index=False).mean()

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

In [185]:
df.groupby(['sex','smoker'],as_index=True).mean()

               total_bill       tip      size   tip_pct
sex    smoker
Female No       18.105185  2.773519  2.592593  0.156921
       Yes      17.977879  2.931515  2.242424  0.182150
Male   No       19.791237  3.113402  2.711340  0.160669
       Yes      22.284500  3.051167  2.500000  0.152771

当然，对结果调用reset_index也能得到这种形式的结果
<table >警告：groupby的这种用法比较缺少灵活性

# 分组级运算和转换